{
	"frontend_web_engineer": "Ingeniero Web Front-End",
	"frontend_engineer": "ingeniero front-end",
	"menu": "Menú",
	"close": "Cerrar",
	"copyright": "Derechos de autor",
	"rights": ". Todos los derechos reservados.",
	"credits": "Créditos",
	"design": "Diseño",
	"code": "Código",
	"translation": "Traducción",
	"photos": "Fotos",
	"menu_items": {
		"work": "Proyectos",
		"about": "Acerca de",
		"contact": "Contacto"
	},
	"about_headings": {
		"bio": "Sobre mí",
		"skills": "Experiencia técnica",
		"experience": "Historial laboral",
		"education": "Educación"
	},
	"bio": {
		"p1": "Soy Ian, un meticuloso desarrollador front-end radicado en BC, <strong>creando sitios web elegantes y de alto rendimiento, plataformas CMS personalizadas y aplicaciones web dinámicas</strong> impulsadas por JavaScript moderno y React.",
		"p2": {
			"part1": "<strong>Me desenvuelvo en la intersección del código, el diseño y la lógica</strong>. Con una Licenciatura en ",
			"cpsc": "Ciencias de la Computación",
			"and": " y ",
			"stats": "Estadística",
			"part2": " de la UBC, y habiendo terminado como uno de los mejores en el programa de ",
			"frontend_dev": "Desarrollo Front-End",
			"part3": " de BCIT, he pasado la última década transformando ideas complejas en experiencias digitales limpias e intuitivas."
		},
		"p3": {
			"part1": "Aunque el desarrollo es mi enfoque principal, siempre he estado involucrado también en el mundo del diseño. Tengo experiencia con Photoshop y <strong>disfruto contribuir a las decisiones de UI y UX para que los proyectos luzcan tan bien como funcionan</strong>. Fuera del editor de código, disfruto tocar el piano y ",
			"composer": "componer música",
			"part2": " como una vía de expresión creativa."
		}
	},
	"skill_list": {
		"programming_languages": "Lenguajes de programación",
		"professional_skillset": "Conjunto de habilidades profesionales",
		"development_tools": "Herramientas de desarrollo",
		"latest": " (última versión)",
		"spa_development": "Desarrollo de SPA",
		"gsap_animation": "Animación GSAP",
		"sql_database": "Base de datos SQL"
	},
	"jobs": {
		"sfu": {
			"company": "Universidad Simon Fraser",
			"role": "Desarrollador de aplicaciones",
			"time": "Julio 2022 - Presente",
			"description": "Único especialista front-end dentro del equipo central de Servicios de TI de SFU, liderando todo el desarrollo front-end y brindando soporte técnico en el ecosistema de aplicaciones web de la universidad. Responsable de construir y mantener las aplicaciones web personalizadas de SFU, incluyendo sus sistemas de gestión de contenido Adobe Experience Manager (AEM), utilizados diariamente por miles de profesores y personal para crear y gestionar sus propios sitios web de departamento y facultad.",
			"footnote": "Universidad pública de investigación en Columbia Británica"
		},
		"signals": {
			"company": "Signals Design",
			"role": "Desarrollador front-end",
			"time": "Julio 2017 - Julio 2020",
			"description": "Colaboré en diversos proyectos para clientes como UBC, Clear Seas, Foundry, BCNU, Crofton House, MYM y la Graham Boeckh Foundation. Diseñé y desarrollé de forma independiente una aplicación web personalizada para la gestión de equipos, proyectos y presupuestos, integrando múltiples APIs. La plataforma fue ampliamente adoptada por gerentes y contadores internos para operaciones diarias.",
			"footnote": "Agencia de diseño con base en Vancouver"
		},
		"shoes": {
			"company": "Shoes.com",
			"role": "Desarrollador front-end",
			"time": "Noviembre 2015 - Agosto 2016",
			"description": "Trabajé en estrecha colaboración con diseñadores, gerentes de proyecto, mercadólogos y desarrolladores para construir funcionalidades UI responsivas y páginas web para las plataformas de comercio electrónico de la empresa en varios entornos. Seguí flujos de trabajo modernos de desarrollo, incluyendo automatización de tareas con Grunt y Gulp, control de versiones con Git y pruebas A/B usando Maxymiser.",
			"footnote": "Empresa de comercio electrónico con base en Vancouver y Seattle"
		}
	},
	"education": {
		"ubc": {
			"name": "Universidad de Columbia Británica",
			"short": "UBC",
			"degree": "Licenciatura en Ciencias, informática y estadística",
			"degree_short": "Lic. Ciencias en informática y estadística",
			"grad": "Vancouver, Columbia Británica, mayo 2015"
		},
		"bcit": {
			"name": "Instituto de Tecnología de Columbia Británica",
			"short": "BCIT",
			"degree": "Certificado, desarrollador front-end con distinción",
			"degree_short": "Desarrollador front-end con distinción",
			"grad": "Vancouver, Columbia Británica, octubre 2015"
		}
	},
	"bio_closing": {
		"part1": "Aporto un ojo crítico y una gran atención al detalle a cada proyecto, buscando lograr el equilibrio adecuado entre función y forma. Para mí, un buen desarrollo web significa más que código limpio: se trata de crear experiencias modernas, visualmente pulidas e intuitivas que sean realmente agradables de usar. Siempre estoy en busca de proyectos interesantes con gente increíble. ¿Tienes algo en mente? No dudes en ",
		"contact_me": "contactarme",
		"part2": "."
	},
	"projects": {
		"sfu": {
			"title": "Universidad Simon Fraser",
			"footnote": "Adobe Experience Manager",
			"description": "Una plataforma AEM a gran escala que permite a miles de profesores y personal crear y gestionar fácilmente sus propios sitios web."
		},
		"foundry": {
			"title": "Foundry BC",
			"footnote": "Sitio WordPress Avanzado",
			"description": "Un sitio WordPress completo que guía a los jóvenes y adultos jóvenes de Columbia Británica a descubrir servicios y recursos esenciales."
		},
		"clearseas-oil-spills": {
			"title": "Clear Seas",
			"footnote": "Micrositio WordPress",
			"description": "Uno de seis micrositios bilingües desarrollados para Clear Seas, cada uno con temas WordPress completamente personalizados."
		},
		"ubc-med-pathways": {
			"title": "UBC Med Pathways",
			"footnote": "Revista Digital Universitaria",
			"description": "Una revista digital de la Facultad de Medicina de la UBC que presenta múltiples números y una variedad de componentes interactivos personalizados."
		},
		"gbf": {
			"title": "Graham Boeckh Foundation",
			"footnote": "Tema WordPress Personalizado",
			"description": "Un sitio WordPress bilingüe para una fundación privada, incorporando múltiples componentes hechos a medida."
		},
		"bcnu": {
			"title": "Informe Anual BCNU",
			"footnote": "Sitio tipo Folleto",
			"description": "Un sitio WordPress tipo folleto para el Sindicato de Enfermeras de Columbia Británica, construido a partir de un tema totalmente personalizado desarrollado desde cero."
		},
		"underwater-noise": {
			"title": "Ruido Submarino",
			"footnote": "Micrositio WordPress",
			"description": "Otro de los seis micrositios bilingües construidos para Clear Seas, con temas WordPress a medida."
		}
	},
	"project_tooltip": {
		"open_application": "Abrir aplicación",
		"visit_site": "Visitar sitio",
		"view_project": "Ver proyecto",
		"play_game": "Jugar juego"
	},
	"learn_more_about_ian": {
		"part1": "Todo lo que necesitas saber sobre ",
		"ian": "Ian",
		"part2": ""
	},
	"need_help": {
		"part1": "¿Necesitas ayuda? ",
		"part2": "¡Envíame un mensaje!"
	},
	"download_resume": "Descargar currículum",
	"form": {
		"name": "Nombre",
		"email": "Correo electrónico",
		"subject": "Asunto",
		"message": "Mensaje",
		"submit": "Enviar mensaje",
		"min": "mínimo",
		"max": "máximo",
		"sending": "Enviando...",
		"sent": "Tu mensaje ha sido enviado. ¡Me pondré en contacto contigo pronto!",
		"failed": "Vaya… Algo salió mal. Por favor, inténtalo de nuevo más tarde o utiliza la información de contacto arriba."
	}
}
